app/controllers/items_controller.rb

    def index
        render json: Item.all
---
SELECT "items".* FROM "items"

    def create
        item = Item.new(item_params)
        if item.save
---
INSERT INTO "items" ("name", "price", "image", "description", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
        item = Item.find(params[:id])
        item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 13]]

    def purchase
        item = Item.find(params[:item_id])
        user = User.find(session[:user_id])
        qp = params[:quantity].to_i

        updated_item = item.purchase(qp, user)

        if updated_item.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "items" SET "quantity" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["quantity", 10], ["updated_at", "2022-09-16 02:46:22.882812"], ["id", 9]]

    def my_items
        uirs = UserItemRelationship.where(user_id: session[:user_id])
        items = uirs.map{|uir| uir.item}
---
SELECT "user_item_relationships".* FROM "user_item_relationships" WHERE "user_item_relationships"."user_id" = $1  [["user_id", 15]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "user_item_relationships".* FROM "user_item_relationships" WHERE "user_item_relationships"."user_id" = $1  [["user_id", 5]]