app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "bob"], ["created_at", "2022-09-16 01:06:08.859495"], ["updated_at", "2022-09-16 01:06:08.859495"], ["password_digest", "$2a$12$NOtenbtbwwMlluul1cw7S.PTLZ/0nbWgTCBlVvq2ScBOv9uEhVXly"]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", false], ["updated_at", "2022-09-16 01:06:08.883868"], ["id", 9]]
---
    def create
        user = User.create(user_params)
        user.update(admin: false) unless params["admin"].present?