app/models/item.rb

INSERT INTO "user_item_relationships" ("item_id", "user_id", "quantity_purchased", "transaction_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_id", 9], ["user_id", 6], ["quantity_purchased", 1], ["transaction_amount", 13.0], ["created_at", "2022-09-16 02:10:29.103949"], ["updated_at", "2022-09-16 02:10:29.103949"]]
---
    def purchase(quantity_purchased, user)
        uir = UserItemRelationship.create(
            user_id: user.id,
            item_id: self.id,
            quantity_purchased: quantity_purchased,
            transaction_amount: self.price * quantity_purchased
        )